app/controllers/thread_for_post_controller.rb

SELECT  "thread_for_posts".* FROM "thread_for_posts"  WHERE "thread_for_posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"  WHERE "posts"."thread_for_post_id" = $1  [["thread_for_post_id", 4]]
---
	def show
		@thread = ThreadForPost.find(params[:id])